{"format": "layers-model", "generatedBy": "keras v2.15.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "modelTopology": {"keras_version": "2.15.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 55, 47, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "Conv1", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 55, 47, 3], "filters": 20, "kernel_size": [4, 4], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "Pool1", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "Pool1", "inbound_nodes": [[["Conv1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "D1", "trainable": true, "dtype": "float32", "rate": 0.99, "noise_shape": null, "seed": null}, "name": "D1", "inbound_nodes": [[["Pool1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2", "trainable": true, "dtype": "float32", "filters": 40, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2", "inbound_nodes": [[["D1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "Pool2", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "Pool2", "inbound_nodes": [[["Conv2", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "D2", "trainable": true, "dtype": "float32", "rate": 0.99, "noise_shape": null, "seed": null}, "name": "D2", "inbound_nodes": [[["Pool2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv3", "trainable": true, "dtype": "float32", "filters": 60, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv3", "inbound_nodes": [[["D2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "Pool3", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "Pool3", "inbound_nodes": [[["Conv3", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "D3", "trainable": true, "dtype": "float32", "rate": 0.99, "noise_shape": null, "seed": null}, "name": "D3", "inbound_nodes": [[["Pool3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv4", "trainable": true, "dtype": "float32", "filters": 80, "kernel_size": [2, 2], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv4", "inbound_nodes": [[["D3", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten", "inbound_nodes": [[["D3", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_1", "inbound_nodes": [[["Conv4", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "fc11", "trainable": true, "dtype": "float32", "units": 160, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fc11", "inbound_nodes": [[["flatten", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "fc12", "trainable": true, "dtype": "float32", "units": 160, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fc12", "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add", "trainable": true, "dtype": "float32"}, "name": "add", "inbound_nodes": [[["fc11", 0, 0, {}], ["fc12", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "deepid", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "deepid", "inbound_nodes": [[["add", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["deepid", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "Conv1/kernel", "shape": [4, 4, 3, 20], "dtype": "float32"}, {"name": "Conv1/bias", "shape": [20], "dtype": "float32"}, {"name": "Conv2/kernel", "shape": [3, 3, 20, 40], "dtype": "float32"}, {"name": "Conv2/bias", "shape": [40], "dtype": "float32"}, {"name": "Conv3/kernel", "shape": [3, 3, 40, 60], "dtype": "float32"}, {"name": "Conv3/bias", "shape": [60], "dtype": "float32"}, {"name": "Conv4/kernel", "shape": [2, 2, 60, 80], "dtype": "float32"}, {"name": "Conv4/bias", "shape": [80], "dtype": "float32"}, {"name": "fc11/kernel", "shape": [1200, 160], "dtype": "float32"}, {"name": "fc11/bias", "shape": [160], "dtype": "float32"}, {"name": "fc12/kernel", "shape": [960, 160], "dtype": "float32"}, {"name": "fc12/bias", "shape": [160], "dtype": "float32"}]}]}